simulations/run001/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input"

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         $endT;

deltaT          $dt;

writeControl    runTime;

writeInterval   $writeInt;

purgeWrite      0;

writeFormat     binary; //ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{

    #includeFunc    residuals(p_rgh)    
    
    #include	"functionObjects/fieldAverage"
    #include	"functionObjects/surfaces"
    #include	"functionObjects/holdUp"
}


// ************************************************************************* //
